org-configs/index.org
# Created 2021-06-15 Tue 18:24
#+OPTIONS: H:3 num:nil toc:t \n:nil ::t |:t ^:t -:t f:t *:t tex:t d:(HIDE) tags:not-in-toc
#+TITLE: Org Customization
#+AUTHOR: Worg people
#+startup: align fold nodlcheck hidestars oddeven lognotestate
#+seq_todo: TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+tags: Write(w) Update(u) Fix(f) Check(c)
#+language: en
#+priorities: A C B
#+category: worg
[[file:../index.org][{Back to Worg's index}]]

This page contains general information about Org-mode customization.

* Org customization

#+index: Customization

Org-mode is highly customizable, but can be used with very little setup.

- [[file:org-customization-guide.org][Org customization guide for beginners]]
- [[file:org-customization-survey-2013.org][Org customization survey results]]
- Complete lists of Org [[file:../doc.org::#hooks][hooks]], [[file:../doc.org::#options][options]] and [[file:../doc.org::#commands][commands]]

- [[file:org-config-examples.org][Random Org configuration examples]]

Also the following pages from our [[file:../org-tutorials/index.org][Tutorials section]] are relevant for
Org customization:

- [[file:../org-tutorials/org-customize.org][Using customize to find and set options]]
- [[file:../org-tutorials/org-custom-agenda-commands.org][Using custom agenda commands]]

There is also a page about [[https://orgmode.org/worg/org-tutorials/org-appearance.html#org9370750][customizing Org faces]].
