org-configs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-15 Tue 18:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org Customization</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Worg people" />
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/htmlize.css"/>
 <link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Org Customization</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9ba3baf">Org customization</a></li>
</ul>
</div>
</div>
<p>
<a href="../index.html">{Back to Worg&rsquo;s index}</a>
</p>

<p>
This page contains general information about Org-mode customization.
</p>

<div id="outline-container-org9ba3baf" class="outline-2">
<h2 id="org9ba3baf">Org customization</h2>
<div class="outline-text-2" id="text-org9ba3baf">
<p>
Org-mode is highly customizable, but can be used with very little setup.
</p>

<ul class="org-ul">
<li><a href="org-customization-guide.html">Org customization guide for beginners</a></li>
<li><a href="org-customization-survey-2013.html">Org customization survey results</a></li>
<li>Complete lists of Org <a href="../doc.html#hooks">hooks</a>, <a href="../doc.html#options">options</a> and <a href="../doc.html#commands">commands</a></li>

<li><a href="org-config-examples.html">Random Org configuration examples</a></li>
</ul>

<p>
Also the following pages from our <a href="../org-tutorials/index.html">Tutorials section</a> are relevant for
Org customization:
</p>

<ul class="org-ul">
<li><a href="../org-tutorials/org-customize.html">Using customize to find and set options</a></li>
<li><a href="../org-tutorials/org-custom-agenda-commands.html">Using custom agenda commands</a></li>
</ul>

<p>
There is also a page about <a href="https://orgmode.org/worg/org-tutorials/org-appearance.html#org9370750">customizing Org faces</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Worg people</p>
<p class="date">Created: 2021-06-15 Tue 18:24</p>
</div>
</body>
</html>
